OpenFOAM-v2112/modules/OpenQBMM/tutorials/diluteVdfTransportFoam/rotatingCylinder/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhase fluid;
dilutePhase     particles;

pMin 1000;
fluid
{
    residualAlpha   0;
    d 1e-6;
}
particles
{
    residualAlpha   1e-6;
    d 3e-3;
}

aspectRatio
{
    type constant;
    E0   1.0;
}

drag
{
    type        Stokes;
    residualRe  1e-3;
    dragTime    10;

    swarmCorrection
    {
        type none;
    }
}
